#pragma once

#include <Poco/SharedPtr.h>

#include <DB/Parsers/IAST.h>
#include <DB/Interpreters/Context.h>


namespace DB
{

/** Интерпретирует выражение из синтаксического дерева,
  *  в котором присутствуют имена столбцов, константы и обычные функции.
  */
class Expression
{
public:
	Expression(IAST & ast_, const Context & context_) : ast(ast_), context(context_)
	{
		addSemantic();
		checkTypes();
		glueTree();
	}

	/** Выполнить выражение над блоком. Блок должен содержать все столбцы - идентификаторы.
	  */
	void execute(Block & block);

private:
	IAST & ast;
	Context & context;

	
	/** Для узлов - литералов, создать соответствующие столбцы-константы и типы данных.
	  * Для узлов - функций - прописать ссылки на функции и заменить имена на канонические.
	  * Для узлов - идентификаторов - прописать ссылки на их типы.
	  */
	void addSemantic();

	/** Проверить, что все функции применимы.
	  */
	void checkTypes();

	/** Склеить одинаковые узлы в синтаксическом дереве (превращая его в направленный ациклический граф).
	  * Это означает, в том числе то, что функции с одними и теми же аргументами, будут выполняться только один раз.
	  * Например, выражение rand(), rand() вернёт два идентичных столбца.
	  * Поэтому, все функции, в которых такое поведение нежелательно, должны содержать дополнительный параметр "тег".
	  */
	void glueTree();
};


}
