#pragma once

namespace DB
{

/** Протокол взаимодействия с сервером.
  */

namespace Protocol
{
	/// То, что передаёт сервер.
	namespace Server
	{
		enum Enum
		{
			Hello,			/// Имя, версия, ревизия.
			Data,			/// Идентификатор запроса, признак последнего чанка, размер чанка, часть данных со сжатием или без.
			Exception,		/// Исключение во время обработки запроса.
			Progress,		/// Прогресс выполнения запроса: строк считано, всего строк, байт считано, всего байт.
		};
	}

	/// То, что передаёт клиент.
	namespace Client
	{
		enum Enum
		{
			Query,			/** Идентификатор запроса, информация, до какой стадии исполнять запрос,
							  * использовать ли сжатие, формат входных данных, формат выходных данных, текст запроса (без данных для INSERT-а).
							  */
			Data,			/// Идентификатор запроса, признак последнего чанка, размер чанка, часть данных со сжатием или без.
		};
	}

	/// До какой стадии выполнять запрос.
	namespace QueryProcessingStage
	{
		enum Enum
		{
			Complete,			/// Полностью.
			WithMergeableState,	/// До стадии, когда результаты обработки на разных серверах можно объединить.
		};
	}

	/// Использовать ли сжатие.
	namespace Compression
	{
		enum Enum
		{
			Disable,
			Enable,
		};
	}
}

}
