#pragma once

namespace DB
{

/** Протокол взаимодействия с сервером.
  */

namespace Protocol
{
	/// То, что передаёт сервер.
	namespace Server
	{
		enum Enum
		{
			Hello = 0,		/// Имя, версия, ревизия.
			Data = 1,		/// Идентификатор запроса, признак последнего чанка, размер чанка, часть данных со сжатием или без.
			Exception = 2,	/// Исключение во время обработки запроса.
			Progress = 3,	/// Прогресс выполнения запроса: строк считано, всего строк, байт считано, всего байт.
		};
	}

	/// То, что передаёт клиент.
	namespace Client
	{
		enum Enum
		{
			Query = 0,		/** Идентификатор запроса, информация, до какой стадии исполнять запрос,
							  * использовать ли сжатие, формат входных данных, формат выходных данных, текст запроса (без данных для INSERT-а).
							  */
			Data = 1,		/// Идентификатор запроса, признак последнего чанка, размер чанка, часть данных со сжатием или без.
		};
	}

	/// До какой стадии выполнять запрос.
	namespace QueryProcessingStage
	{
		enum Enum
		{
			Complete = 0,			/// Полностью.
			WithMergeableState = 1,	/// До стадии, когда результаты обработки на разных серверах можно объединить.
		};
	}

	/// Использовать ли сжатие.
	namespace Compression
	{
		enum Enum
		{
			Disable = 0,
			Enable = 1,
		};
	}
}

}
