#pragma once

namespace DB
{

/** Протокол взаимодействия с сервером.
  */

namespace Protocol
{
	/// То, что передаёт сервер.
	namespace Server
	{
		enum Enum
		{
			Hello,			/// Имя, версия, ревизия.
			ResultBlock,	/// Идентификатор запроса, признак последнего блока, блок результата в формате Native со сжатием.
			Exception,		/// Исключение во время обработки запроса.
			Progress,		/// Прогресс выполнения запроса: строк считано, всего строк, байт считано, всего байт.
		};
	}

	/// То, что передаёт клиент.
	namespace Client
	{
		enum Enum
		{
			QueryHeader,	/// Идентификатор запроса, информация, до какой стадии исполнять запрос.
			QueryPart,		/// Кусок запроса - длина, признак последнего куска, байты.
		};
	}

	/// До какой стадии выполнять запрос.
	namespace QueryProcessingStage
	{
		enum Enum
		{
			Complete,			/// Полностью.
			WithMergeableState,	/// До стадии, когда результаты обработки на разных серверах можно объединить.
		};
	}
}

}
