#pragma once

namespace DB
{

/** Отвечает за хранение локальных данных всех *MergeTree движков.
  *  - Поддерживает набор кусков на диске. Синхронизирует доступ к ним, поддерживает в памяти их список.
  *  - Полностью выполняет запросы SELECT.
  *  - Сам не принимает решений об изменении данных.
  *  - Умеет двавть рекомендации:
  *  	- Говорить, какие куски нужно удалить, потому что они покрыты другими кусками.
  *  	- Выбирать набор кусков для слияния.
  *  	  При этом нужна внешняя информация о том, какие куски с какими разрешено объединять.
  *  - Умеет изменять данные по запросу:
  *  	- Записать новый кусок с данными из блока.
  *  	- Слить указанные куски.
  *  	- Сделать ALTER.
  */
class MergeTreeData
{
public:

private:

};

}
