Repository: ClickHouse/ClickHouse
Catalog: website/locale/*/LC_MESSAGES/messages.po
Languages: es, fa, fr, ja, ru, tr

source: ClickHouse is a fast open-source column-oriented database management system that allows generating analytical data reports in real-time using SQL queries
es: ClickHouse es un rápido sistema de gestión de bases de datos orientado a columnas de código abierto que permite generar informes de datos analíticos en tiempo real utilizando consultas SQL
fa: در تاتر یک منبع باز سیستم مدیریت پایگاه داده ستون گرا سریع است که اجازه می دهد تا تولید گزارش داده تحلیلی در زمان واقعی با استفاده از پرس و جو گذاشتن است
fr: ClickHouse est un système de gestion de base de données orienté colonne open-source rapide qui permet de générer des rapports de données analytiques en temps réel à l'aide de requêtes SQL
ja: ClickHouseがオープンソース列指向データベース管理システムで生成解析データ報告をリアルタイムのSQLクエリー
ru: ClickHouse-это быстрая система управления базами данных с открытым исходным кодом, ориентированная на столбцы, которая позволяет создавать аналитические отчеты о данных в режиме реального времени с использованием SQL-запросов
tr: ClickHouse SQL sorguları kullanarak gerçek zamanlı olarak analitik veri raporları üreten sağlayan hızlı bir açık kaynak sütun odaklı veritabanı yönetim sistemidir

source: ClickHouse - fast open-source OLAP DBMS
es: ClickHouse - DBMS OLAP de código abierto rápido
fa: ClickHouse - سریع باز-منبع OLAP DBMS
fr: ClickHouse-SGBD OLAP open-source rapide
ja: ﾂ環板篠ｮﾂ嘉ｯﾂ偲青エﾂδﾂ-ﾂエﾂスﾂ-ﾂシﾂ
ru: ClickHouse-быстрая СУБД OLAP с открытым исходным кодом
tr: ClickHouse - hızlı açık kaynak OLAP DBMS

source: ClickHouse DBMS
es: Sistema abierto.
fa: خانه عروسکی
fr: SGBD ClickHouse
ja: クリックハウスDBMS
ru: СУБД ClickHouse

source: open-source
es: de código abierto
fa: متن باز
ja: オープンソース
ru: открытый исходный код
tr: açık kaynak

source: relational
es: relacional
fa: رابطه
fr: relationnel
ja: 関係
ru: реляционный
tr: ilişkisel

source: analytics
es: analítica
fa: تجزیه و تحلیل
ru: аналитика
tr: analiz

source: analytical
es: analítico
fa: تحلیلی
fr: analytique
ja: 分析
ru: аналитический
tr: analitik

source: Big Data
es: Grandes Datos
fa: داده های بزرگ
ja: ビッグデータ
ru: большие данные
tr: Büyük Veri

source: web-analytics
es: Sistema abierto.
fa: تجزیه و تحلیل وب سایت
ja: ウェブ分析
ru: веб-аналитика

source: ClickHouse source code is published under the Apache 2.0 License.
es: El código fuente de ClickHouse se publica bajo la licencia Apache 2.0.
fa: کد منبع را کلیک کنیدهاوس تحت گواهی 2.0 منتشر شده است.
fr: Le code source de ClickHouse est publié sous la licence Apache 2.0.
ja: ClickHouseソースコードが公開されてApache2.0のライセンスです。
ru: Исходный код ClickHouse публикуется под лицензией Apache 2.0.
tr: ClickHouse kaynak kodu Apache 2.0 Lisansı altında yayınlandı.

source: Software is distributed on an "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
es: El software se distribuye "TAL CUAL", SIN GARANTÍAS O CONDICIONES DE NINGÚN TIPO, ya sea expresa o implícita.
fa: نرم افزار بر اساس "به عنوان" توزیع, بدون ضمانت یا شرایط از هر نوع, هم بیان یا ضمنی.
fr: Le logiciel est distribué "tel quel", sans garantie ni condition d'AUCUNE SORTE, expresse ou implicite.
ja: ソフトウェアは、明示または黙示を問わず、いかなる種類の保証または条件なしに、"現状のまま"ベースで配布されます。
ru: Программное обеспечение распространяется на условиях "как есть", без каких-либо гарантий или условий, явных или подразумеваемых.
tr: Yazılım "OLDUĞU GİBİ" BAZINDA dağıtılır, GARANTİ VEYA HERHANGİ bir şart OLMADAN, Açık veya zımni.

source: Yandex LLC
es: Sistema abierto.
ru: ООО «Яндекс»

source: Published date
es: Fecha de publicación
ru: Дата публикации
tr: Yayım datelandığı tarih

source: Documentation
es: Documentación
ru: Документация
tr: Belge

source: Rating
es: Clasificación
fa: درجهبندی
fr: Évaluation
ru: Рейтинг
tr: Verim

source: votes
es: voto
fa: رای
fr: vote
ru: голосов
tr: oylar

source: Article Rating
es: Clasificación del artículo
fa: رتبه مقاله
fr: L'Article De Notation
ru: Рейтинг статьи
tr: Makale Değerlendirme

source: Was this content helpful?
es: ¿Este contenido fue útil?
fa: این مطالب مفید بود?
fr: Ce contenu a été utile?
ru: Был ли этот контент полезным?
tr: Bu içerik yararlı mıydı?

source: Unusable
es: Inutilizable
fa: غیرقابل استفاده
fr: Inutilisable
ru: Непригодная
tr: Kullanışsız

source: Poor
es: Pobre
fa: فقیر
fr: Pauvre
ru: Плохая
tr: Zavallı

source: Good
es: Bien
fa: خوبه
fr: Bien
ru: Хорошая
tr: İyi

source: Excellent
es: Excelente
fa: عالیه
ru: Отличная
tr: Mükemmel

source: documentation
es: documentación
fa: مستندات
ru: документация
tr: belge

source: Built from
es: Construido a partir de
fa: ساخته شده از
fr: Construit à partir de
ja: から構築
ru: Собрано из
tr: Dahili

source: published on
es: publicado en
fa: منتشر شده در
fr: publié le
ru: опубликовано
tr: yayınlanan

source: modified on
es: modificado en
fa: تغییریافته
fr: modifié sur
ru: изменено
tr: modifiye on

source: Help wanted!
es: Ayuda quería!
fa: راهنما می خواستم!
fr: Demander de l'aide!
ja: 助けが欲しかった！
ru: Нужна помощь!
tr: Yardım istedi!

source: The following content of this documentation page has been machine-translated. But unlike other websites, it is not done on the fly. This translated text lives on GitHub repository alongside main ClickHouse codebase and waits for fellow native speakers to make it more human-readable.
es: El siguiente contenido de esta página de documentación ha sido traducido por máquina. Pero a diferencia de otros sitios web, no se hace sobre la marcha. Este texto traducido vive en el repositorio de GitHub junto con la base de código principal de ClickHouse y espera a que otros hablantes nativos lo hagan más legible por humanos.
fa: محتوای زیر از این صفحه اسناد شده است ماشین ترجمه. اما بر خلاف وب سایت های دیگر, این است که در پرواز انجام نمی. این متن ترجمه شده در مخزن گیتهاب در کنار پایگاه داده اصلی خانه کلیک زندگی می کند و منتظر سخنرانان مادری همکار به انسان بیشتر قابل خواندن است.
fr: Le contenu suivant de cette page de documentation a été traduit à la machine. Mais contrairement à d'autres sites web, il ne se fait pas à la volée. Ce texte traduit vit sur le dépôt GitHub aux côtés de la base de code ClickHouse principale et attend que d'autres locuteurs natifs le rendent plus lisible par l'homme.
ja: このドキュメントページの以下の内容は機械翻訳されています。 異な他のウェブサイトで行われませんができます。 この翻訳テキスト生活をGitHubリポジトリとClickHouseコードベース、待ち員ネイティブスピーカーで人間が読む.
ru: Нижеследующее содержание этой страницы документации было создано через машинный перевод. Но в отличие от других сайтов, это делается не на лету. Этот переведенный текст живет в репозитории GitHub вместе с основной кодовой базой ClickHouse и ждет, когда другие носители языка сделают его более удобочитаемым.
tr: Bu Dokümantasyon sayfasının aşağıdaki içeriği makine tarafından çevrilmiştir. Ancak diğer web sitelerinin aksine, anında yapılmaz. Bu çevrilmiş metin, ana ClickHouse kod tabanının yanında GitHub deposunda yaşar ve diğer anadili konuşanların daha insan tarafından okunabilir olmasını bekler.

source: You can also use the original English version as a reference.
es: También puede usar la versión original en inglés como referencia.
fa: شما همچنین می توانید نسخه اصلی انگلیسی به عنوان یک مرجع استفاده کنید.
fr: Vous pouvez également utiliser la version originale anglaise comme référence.
ja: また、参照として、元の英語版を使用することができます。
ru: Вы также можете использовать оригинальную английскую версию в качестве образца.
tr: Orijinal İngilizce sürümünü referans olarak da kullanabilirsiniz.

source: Help ClickHouse documentation by editing this page
es: Ayuda a la documentación de ClickHouse editando esta página
fa: راهنما مستندات تاتر با ویرایش این صفحه
fr: Aide clickhouse documentation en éditant cette page
ja: このページを編集してClickHouseの文書を編集する
ru: Помогите документации ClickHouse, отредактировав эту страницу
tr: Bu sayfayı düzenleyerek ClickHouse belgelerine yardım edin

source: Multi-page or single-page
es: Multi-página o de una sola página
fa: چند صفحه یا یک صفحه
fr: Multi-page ou une seule page
ja: 複数ページまたは単一ページ
ru: Многостраничный или одностраничный
tr: Çok sayfalı veya tek sayfalı

source: Multi-page version
es: Versión de varias páginas
fa: نسخه چند صفحه ای
fr: Multi-version de la page
ja: 複数ページバージョン
ru: Многостраничная версия
tr: Çok sayfalı sürüm

source: Single-page version
es: Versión de una sola página
fa: نسخه تک صفحه ای
fr: Version d'une seule page
ja: 単一ページ版
ru: Одностраничная версия
tr: Tek sayfalık sürüm

source: Version
es: Versión
fa: نسخه
ja: バージョン
ru: Версия
tr: Sürüm

source: latest
es: reciente
fa: جدیدترین
fr: dernier
ja: 最新の
ru: последняя
tr: son

source: PDF version
es: Versión PDF
fa: نسخه PDF
fr: Version PDF
ja: PDFバージョン
ru: PDF-версия
tr: PDF versiyonu

source: Table of Contents
es: Tabla de contenido
fa: جدول محتویات
fr: Table des matières
ja: テーブルの内容
ru: Cодержание
tr: İçindekiler tablosu

source: ClickHouse community
es: ClickHouse de la comunidad
fa: جامعه کلیک
fr: Clickhouse communauté
ja: ClickHouse地域
ru: ClickHouse сообщество
tr: ClickHouse topluluğu

source: ClickHouse YouTube Channel
es: ClickHouse Canal de YouTube
fa: تاتر کانال یوتیوب
fr: ClickHouse Chaîne YouTube
ja: ClickHouse YouTubeチャンネル
ru: YouTube канал ClickHouse
tr: ClickHouse YouTube Kanalı

source: ClickHouse Official Twitter Account
es: Cuenta oficial de Twitter de ClickHouse
fa: حساب توییتر رسمی کلیک کنید
fr: ClickHouse Compte Twitter Officiel
ja: ClickHouse公式Twitterアカウント
ru: Официальный аккаунт в Twitter
tr: ClickHouse Resmi Twitter Hesabı

source: ClickHouse at Telegram
es: ClickHouse en Telegram
fa: تاتر در تلگرام
fr: ClickHouse au Télégramme
ja: ClickHouseで電報
ru: ClickHouse в Telegram
tr: Telegram'da ClickHouse

source: Chat with real users in
es: Chatear con usuarios reales en
fa: چت با کاربران واقعی در
fr: Discuter avec de vrais utilisateurs dans
ja: で実際のユーザーとチャット
ru: Чат с другими пользователями
tr: Gerçek kullanıcılar ile sohbet

source: English
es: Ingl
fa: انگلیسی
fr: Anglais
ja: 英語
ru: Английский
tr: İngilizce

source: or in
es: o en
fa: یا در
fr: ou dans
ja: または
ru: или
tr: veya içinde

source: Russian
es: Ruso
fa: روسی
fr: Russe
ja: ロシア語
ru: Русский
tr: Rusça

source: Open GitHub issue to ask for help or to file a feature request
es: Abra el problema de GitHub para pedir ayuda o para presentar una solicitud de función
fa: باز کردن مشکل گیتهاب برای درخواست کمک و یا به فایل درخواست ویژگی
fr: Ouvrir GitHub question de demander de l'aide, ou pour déposer une demande de fonctionnalité
ja: GitHub issueを開いて助けを求めたり、機能要求を提出したりする
ru: В GitHub Issues можно попросить помочь или запросить новую возможность
tr: Yardım istemek veya bir özellik isteği göndermek için GitHub sorununu açın

source: ClickHouse Slack Workspace
es: Espacio de trabajo de ClickHouse Slack
fa: فضای کاری شل کلیک
fr: Espace De Travail ClickHouse Slack
ja: ClickHouseみワークスペース
ru: ClickHouse Slack
tr: ClickHouse Slack Çalışma Alanı

source: Multipurpose public hangout
es: Lugar de reunión público multiusos
fa: چند منظوره پاتوق عمومی
fr: Lieu de rencontre public polyvalent
ja: 多目的パブリックハングアウト
ru: Универсальное сообщество
tr: Çok amaçlı kamu hangout

source: Ask any questions
es: Haga cualquier pregunta
fa: هر گونه سوال بپرسید
fr: Posez toutes les questions
ja: 質問をする
ru: Задай любые вопросы
tr: Herhangi bir soru sorun

source: ClickHouse Blog
es: Bienvenidos al Portal de LicitaciÃ³n ElectrÃ³nica de LicitaciÃ³n ElectrÃ³nica
fa: وبلاگ کلیک
ja: ClickHouseブログ
ru: Блог ClickHouse

source: in
es: en
fa: داخل
fr: dans
ja: で
ru: в
tr: içinde

source: ClickHouse at Google Groups
es: ClickHouse en Grupos de Google
fa: تاتر در گروه های گوگل
fr: ClickHouse à Google Groupes
ja: Googleグループのクリックハウス
ru: ClickHouse в Google Groups
tr: Google Grupları'nda ClickHouse

source: Email discussions
es: Discusiones por correo electrónico
fa: بحث های ایمیل
fr: Discussions par courriel
ja: メールでの議論
ru: Обсуждения по email
tr: E-posta tartış discussionsmaları

source: Like ClickHouse?
es: ¿Te gusta ClickHouse?
fa: مانند خانه کلیک?
fr: Comme ClickHouse?
ja: ClickHouseのような？
ru: Нравится ClickHouse?
tr: ClickHouse Gibi Mi?

source: Help to spread the word about it via
es: Ayuda a correr la voz al respecto a través de
fa: کمک به گسترش این کلمه از طریق
fr: Aider à passer le mot à ce sujet via
ja: それについての言葉を広めるのに役立ちます
ru: Помоги распространить информацию о нём через
tr: Aracılığıyla bu konuda kelime yaymak için yardım

source: and
es: y
fa: و
fr: et
ja: と
ru: и
tr: ve

source: Hosting ClickHouse Meetups
es: Grupos de Meetup de Hosting ClickHouse
fa: میزبانی اکسسوری تاتر
fr: Accueil Clickhouse Meetups
ja: 開催ClickHouse Meetups
ru: Проведение ClickHouse митапов
tr: ClickHouse Buluşmaları Barındırma

source: ClickHouse meetups are essential for strengthening community worldwide, but they couldn't be possible without the help of local organizers. Please, feel this form if you want to become one or want to meet ClickHouse core team for any other reason.
es: Las reuniones de ClickHouse son esenciales para fortalecer la comunidad en todo el mundo, pero no podrían ser posibles sin la ayuda de los organizadores locales. Por favor, sienta este formulario si desea convertirse en uno o quiere conocer al equipo central de ClickHouse por cualquier otra razón.
fa: اکسسوری کلیک برای تقویت جامعه در سراسر جهان ضروری است, اما نمی تواند بدون کمک سازمان دهندگان محلی امکان پذیر است. لطفا, احساس این فرم اگر شما می خواهید برای تبدیل شدن به یک و یا می خواهید برای دیدار با تیم هسته کلیکاوس به هر دلیلی دیگر.
fr: Les rencontres ClickHouse sont essentielles pour renforcer la communauté dans le monde entier, mais elles ne pourraient pas être possibles sans l'aide d'organisateurs locaux. S'il vous plaît, sentez ce formulaire si vous voulez devenir l'une ou souhaitez rencontrer ClickHouse équipe de base pour toute autre raison.
ja: ClickHouseの交流会は、世界中のコミュニティを強化するために不可欠ですが、彼らは地元の主催者の助けなしには不可能でした。 ﾂつｨﾂ姪"ﾂつ"ﾂ債ﾂづｭﾂつｹﾂづ債、ﾂつｨﾂ電ﾂ話ﾂづﾂつｨﾂ甘ｨﾂつ"ﾂ致ﾂつｵﾂづ慊つｷﾂ。
ru: Встречи ClickHouse необходимы для укрепления сообщества во всем мире, но они не могут быть возможны без помощи местных организаторов. Пожалуйста, почувствуйте эту форму, если вы хотите стать одним из них или хотите встретиться с основной командой ClickHouse по любой другой причине.
tr: ClickHouse buluşmalar dünya çapında toplumu güçlendirmek için gereklidir, ancak yerel organizatörlerin yardımı olmadan mümkün olamazdı. Eğer biri olmak istiyorsanız veya başka bir nedenle ClickHouse çekirdek ekibi karşılamak istiyorsanız, bu formu hissedin.

source: ClickHouse Meetup
es: Haga clic en Meetup de Casa
fa: ناهار خانه
ja: クリックハウスミート
ru: ClickHouse митап

source: Name
es: Nombre
fa: نام
fr: Nom
ja: 名前
ru: Имя
tr: Ad

source: Email
es: Correo
fa: رایانامه
fr: Courriel
ja: メール
tr: Posta

source: Company
es: Empresa
fa: شرکت
fr: Entreprise
ja: 会社
ru: Компания
tr: Şirket

source: City
es: Ciudad
fa: شهر
fr: Ville
ja: 市
ru: Город
tr: Şehir

source: We'd like to host a public ClickHouse Meetup
es: Nos gustaría organizar un Meetup público de ClickHouse
fa: ما می خواهیم میزبان یک ناهار عمومی باشیم
fr: Nous aimerions organiser un Meetup public ClickHouse
ja: というホストの公ClickHouseスク管理のツールとして利用
ru: Мы хотели бы провести публичный ClickHouse митап
tr: Halka açık bir ClickHouse buluşmasına ev sahipliği yapmak istiyoruz

source: We'd like to invite Yandex ClickHouse team to our office
es: Nos gustaría invitar al equipo de Yandex ClickHouse a nuestra oficina
fa: ما می خواهیم از تیم یاندکس کلیک هاوس به دفتر ما دعوت کنیم
fr: Nous aimerions inviter l'équipe de Yandex ClickHouse à notre bureau
ja: という招待Yandex ClickHouseチーム事務局
ru: Мы хотели бы пригласить команду разработки ClickHouse в наш офис
tr: Yandex ClickHouse ekibini ofisimize davet etmek istiyoruz

source: We'd like to invite Yandex ClickHouse team to another event we organize
es: Nos gustaría invitar al equipo de Yandex ClickHouse a otro evento que organizamos
fa: ما می خواهیم از تیم یاندکس کلیک هاوس به رویداد دیگری که سازماندهی می کنیم دعوت کنیم
fr: Nous aimerions inviter l'équipe de Yandex ClickHouse à un autre événement que nous organisons
ja: 私たちは、整理別のイベントにYandexのClickHouseチームを招待したいと思います
ru: Мы хотели бы пригласить команду разработки ClickHouse на другое мероприятие, которое мы организуем
tr: Yandex ClickHouse ekibini organize ettiğimiz başka bir etkinliğe davet etmek istiyoruz

source: We're interested in commercial consulting, support or managed service
es: Estamos interesados en consultoría comercial, soporte o servicio gestionado
fa: ما علاقه مند به مشاوره تجاری هستید, پشتیبانی و یا خدمات مدیریت
fr: Nous sommes intéressés par le conseil commercial, le soutien ou le service géré
ja: しい商業コンサルティングや管理サービス
ru: Мы заинтересованы в консалтинге, коммерческой поддержке или управляемом сервисе
tr: Ticari danışmanlık, destek veya yönetilen hizmetle ilgileniyoruz

source: Additional comments
es: Comentarios adicionales
fa: نظرات اضافی
fr: Commentaires supplémentaires
ja: 追加コメント
ru: Дополнительный комментарий
tr: Ek yorumlar

source: Send
es: Enviar
fa: ارسال
fr: Envoyer
ja: 送信
ru: Отправить
tr: Göndermek

source: If you have any more thoughts or questions, feel free to contact Yandex ClickHouse team directly at
es: Si tiene más pensamientos o preguntas, no dude en ponerse en contacto con el equipo de Yandex ClickHouse directamente en
fa: اگر شما هر گونه افکار و یا سوالات بیشتر, احساس رایگان برای تماس با یاندکس کلیک تیم به طور مستقیم در
fr: Si vous avez d'autres pensées ou questions, n'hésitez pas à contacter L'équipe Yandex ClickHouse directement à
ja: これ以上の考えや質問がある場合は、Yandex ClickHouseチームに直接お気軽にお問い合わせください
ru: Если у вас есть какие-либо мысли или вопросы, не стесняйтесь обращаться в команду ClickHouse в Яндексе напрямую по адресу
tr: Daha fazla düşünceniz veya sorunuz varsa, Yandex ClickHouse ekibiyle doğrudan iletişime geçmekten çekinmeyin

source: turn on JavaScript to see email address
es: activar JavaScript para ver la dirección de correo electrónico
fa: روشن کردن جاوا اسکریپت برای دیدن نشانی رایانامه
fr: activer JavaScript pour voir l'adresse e-mail
ja: turn on JavaScriptを見るメールアドレス
ru: включите JavaScript, чтобы увидеть адрес электронной почты
tr: e-posta adresini görmek için JavaScript'i açın

source: New&nbsp;post
ru: Новый&nbsp;пост
tr: Yeni Mesaj
